vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5534_DFP.pdsc
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.lpc_gpio_adapter.condition_id">
      <require condition="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pint"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.mcxw_flash_adapter.condition_id">
      <require condition="allOf.driver.romapi, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.driver.romapi, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=LPC5534.internal_condition">
      <require condition="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="component.mem_manager_legacy.condition_id">
      <require condition="allOf.component.mem_manager, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.component.mem_manager, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_cache64, driver.flexspi, driver.romapi, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_cache64, driver.flexspi, driver.romapi, device=LPC5534.internal_condition">
      <require condition="anyOf.driver.cache_cache64, driver.flexspi, driver.romapi.internal_condition"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_cache64, driver.flexspi, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.romapi, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.romapi, device=LPC5534.internal_condition">
      <require condition="anyOf.driver.romapi.internal_condition"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=LPC5534.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=LPC5534.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=LPC5534.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.LPC5534.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=LPC5534.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=LPC5534.internal_condition"/>
    </condition>
