vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5534_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC5534_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device LPC5534_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/arm/LPC5534_flash.scf" version="1.0.0" projectpath="LPC5534/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/arm/LPC5534_ram.scf" version="1.0.0" projectpath="LPC5534/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/gcc/LPC5534_flash.ld" version="1.0.0" projectpath="LPC5534/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/gcc/LPC5534_ram.ld" version="1.0.0" projectpath="LPC5534/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/iar/LPC5534_flash.icf" version="1.0.0" projectpath="LPC5534/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5534.condition_id" category="linkerScript" attr="config" name="devices/LPC5534/iar/LPC5534_ram.icf" version="1.0.0" projectpath="LPC5534/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC5534" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template LPC5534</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5534/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5534/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5534/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5534/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5534/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5534/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5534/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5534/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC5534/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device LPC5534_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/LPC5534/iar/startup_LPC5534.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/LPC5534/gcc/startup_LPC5534.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/LPC5534/arm/startup_LPC5534.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC5534_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device LPC5534_system</description>
      <files>
        <file category="sourceC" name="devices/LPC5534/system_LPC5534.c" projectpath="device"/>
        <file category="header" name="devices/LPC5534/system_LPC5534.h" projectpath="device"/>
        <file category="include" name="devices/LPC5534/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="anactrl" Cversion="2.4.0" condition="driver.anactrl.condition_id">
      <description>anactrl Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_anactrl.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_anactrl.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5534/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
