vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5534_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.9.3" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5534/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.3" condition="driver.lpc_dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5534/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_freqme" Cversion="2.1.2" condition="driver.lpc_freqme.condition_id">
      <description>lpc_freqme Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_freqme.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_freqme.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="driver.lpc_gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.2.0" condition="driver.lpc_iocon.condition_id">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_iocon.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcan" Cversion="2.4.2" condition="driver.mcan.condition_id">
      <description>MCAN Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_mcan.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_mcan.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.5" condition="driver.mrt.condition_id">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_mrt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_mrt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="opamp" Cversion="2.2.1" condition="driver.opamp.condition_id">
      <description>OPAMP Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_opamp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_opamp.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.5" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/LPC5534/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5534/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5534/drivers/"/>
      </files>
    </component>
